haivivi/embed-zig/examples/esp/led_strip_anim/zig/sdkconfig.defaults
# LED Strip Animation Example Configuration

# ESP32-S3 target
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Board selection
CONFIG_BOARD_NAME="korvo2_v3"

# Stack size for main task (HAL controller needs more stack)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
